# Soft-skills вопросы

## Топ 10 вопросов

- **Как вы справляетесь с ситуацией, когда кто-то из команды не понимает вашу точку зрения?**
    
    *Ответ:* "Я стараюсь выслушать их позицию и понять, почему они не согласны. Затем я пытаюсь объяснить свою точку зрения более детально, возможно, с примерами или диаграммами. Если мы все равно не можем прийти к согласию, я предлагаю обратиться к более опытному коллеге или руководителю для получения их мнения."
    
- **Как вы справляетесь с конфликтами в команде?**
    
    *Ответ:* "Я считаю, что важен открытый и честный диалог. Когда возникает конфликт, я стараюсь выслушать все стороны и понять их точки зрения. Затем мы обсуждаем возможные решения и ищем компромисс. Если конфликт не удается разрешить, я обращаюсь к руководителю за помощью."
    
- **Что вы предпочитаете и почему: работа в команде или работа в одиночку?**
    
    Я предпочитаю работу в команде, потому что:
    
    1. **Совместное решение проблем**: Командная работа позволяет объединить различные идеи и навыки для более эффективного решения задач.
    2. **Обмен знаниями**: Работая в команде, можно учиться у коллег и делиться своими знаниями, что способствует профессиональному росту.
    3. **Поддержка и мотивация**: Команда предоставляет поддержку и мотивацию, особенно в сложных проектах.
    4. **Разнообразие перспектив**: Разные взгляды и подходы в команде помогают находить более креативные и инновационные решения.
- **Как бы вы справились с товарищем по команде, который не выполнял свою долю работы?**
    
    Для решения ситуации с коллегой, который не выполняет свою долю работы, я бы предпринял следующие шаги:
    
    1. **Неформальный разговор**: Подойду к нему и спрошу, всё ли у него в порядке, и есть ли какие-то проблемы, мешающие работе.
    2. **Предложение помощи**: Предложу свою помощь и поддержку, чтобы вместе решить возможные проблемы.
    3. **Четкие ожидания**: Установлю четкие ожидания и дедлайны, чтобы у всех было одинаковое понимание задач.
    4. **Мониторинг прогресса**: Регулярно буду отслеживать прогресс и предоставлять конструктивный фидбек.
- **Как вы справляетесь с многозадачностью?**
    
    *Ответ:* "Я использую инструменты для управления задачами, такие как Trello или Asana, чтобы организовать и приоритизировать свои задачи. Я стараюсь выполнять наиболее важные и срочные задачи в первую очередь, уделяя время менее важным задачам позже."
    
- **Как вы оцениваете время, необходимое для выполнения задачи?**
    
    *Ответ:* "Я разбиваю задачу на более мелкие части и оцениваю время для каждой из них. Я также учитываю прошлый опыт выполнения подобных задач и возможные блокеры. Если возможно, я советуюсь с коллегами для получения их мнения и коррекции своей оценки."
    
- **Приведите пример, когда вы успешно решили проблему.**
    
    **Пример: Оптимизация производительности веб-приложения**
    
    **Ситуация**: Веб-приложение, над которым я работал, стало медленно загружаться и тормозить при взаимодействии с пользователем из-за большого объема данных и частых запросов к серверу.
    
    **Действия**:
    
    1. **Анализ**: Я начал с анализа производительности с помощью инструментов, таких как Chrome DevTools и Lighthouse, чтобы выявить узкие места.
    2. **Оптимизация**: Я внедрил ленивую загрузку данных и использовал кеширование для часто запрашиваемых ресурсов. Также применил подходы, такие как мемоизация и виртуализация списков, чтобы уменьшить количество рендеров и повысить отзывчивость.
    3. **Тестирование**: Провел тестирование, чтобы убедиться, что улучшения действительно повысили производительность и не вызвали новых проблем.
    
    **Результат**: Производительность приложения значительно улучшилась, время загрузки сократилось на 50%, и пользовательский опыт стал более плавным и отзывчивым.
    
- **Расскажите о случае, когда вам пришлось взять на себя лидерскую роль в проекте.**
    
    *Ответ:* "В одном из проектов наш руководитель был временно недоступен, и я взял на себя координацию работы команды. Я организовал регулярные встречи для обсуждения прогресса, распределял задачи и помогал коллегам с решением технических проблем. Проект был успешно завершен в срок, и команда осталась довольна результатом."
    
- **Почему ушли с прошлого места?**
    - Не освободилась должность, на которую хотел попасть
    - Достиг в компании потолка по технологиям, больше некуда расти
    - Захотел сменить команду, а внутри компании такой возможности не было
    - У проекта, на котором работал, закончилось финансирование
    - Обещали рефакторинг или переход на микросервисы, а на деле занимался легаси-кодом
    - Не заплатили процент, опцион или премию, которую обещали
    - Нужна удаленная работа (если работал в офисе) или наоборот, хочу работать в офисе, дома неудобно
    - Переезд в другой город или страну
    - Нет развития и новых задач, так как проект перешел в стадию поддержки
    - Долгие процессы и согласования, хочется сразу видеть результат работы (если переходишь в стартап)
    - Брали под определенный проект, который сейчас заканчивается (если работал на аутсорсе)
    - Захотел сменить сферу деятельности (бизнес-домен) на ту, что в вакансии
    - Работал по срочному проектному договору, который почти истек, и работодатель не может гарантировать его продление
    - Вынужденный переезд в другой город, а работодателю важно, чтобы работал из офиса
    - Завершил проект и долго сидел без задач, решил уйти
    - Было много неоговоренных и неоплачиваемых переработок
    - Отменили удаленную работу и всех загоняют в офис
- **Чем вы занимаетесь в свободное время?**
    
    Ответ: Свободный. Этот вопрос покажет, есть ли у кандидата амбиции личного развития, а также насколько серьезно он к ним относится. Те, кто стремится улучшить свою личную жизнь, сделают это и в своей профессии.
